# Cadence Encounter(R) RTL Compiler
#   version RC9.1.203 - v09.10-s242_1 (32-bit) built Jul 14 2010
#


set_attribute lib_search_path /tech/umc/faraday/Core/fsd0a_a/2007Q1v1.7
/GENERIC_CORE_1D2V/FrontEnd/synopsys/ /set_attribute library fsd0a_a_generic_core_1d2vtc.lib
/GENERIC_CORE_1D2V/FrontEnd/synopsys/ set_attribute lib_search_path /tech/umc/faraday/Core/fsd0a_a/2007Q1v1.7/GENERIC_CORE_1D2V/FrontEnd/synopsys/ /
/GENERIC_CORE_1D2V/FrontEnd/synopsys/ /seset_attribute lib_search_path /tech/umc/faraday/Core/fsd0a_a/2007Q1v1.7/GENERIC_CORE_1D2V/FrontEnd/synopsys/ /
set_attribute lib_search_path /tech/umc/faraday/Core/fsd0a_a/2007Q1v1.7/GENERIC_CORE_1D2V/FrontEnd/synopsys/ 
set_attribute library fsd0a_a_generic_core_1d2vtc.lib
set_attribute hdl_vhdl_environment common
set_attribute hdl_vhdl_read_version 1993
set_attribute hdl_language vhdl
read_hdl counter.vhd
set_attribute hdl_vhdl_preferred_architecture arch
elaborate
